ProjetoCisao/01.controle/Certificados NFe/TestesNfeAlphaville.txt

GOV_ERRO_TB_ALOCACAO
GOV_ERRO_TB_CENTROCUSTO
GOV_ERRO_TB_CONTACONTABIL
GOV_ERRO_TB_CONTACONTSALDOECCS
GOV_ERRO_TB_DESPADMINISTRATIVA
GOV_ERRO_TB_DIRETORIADEPTO
GOV_ERRO_TB_DIVISAO
GOV_ERRO_TB_DIVISAOAPROPRIACAO
GOV_ERRO_TB_EFETIVOVENDAS
GOV_ERRO_TB_EMPRESA
GOV_ERRO_TB_FINANCIAMENTO
GOV_ERRO_TB_PARTICIPDIVISAO
GOV_ERRO_TB_PARTICIPEMPRESA
GOV_ERRO_TB_PREV_DESP_ADMIN
GOV_ERRO_TB_PREVINCORPORACAO
GOV_ERRO_TB_PREVISAOCONSTRUCAO
GOV_ERRO_TB_RECEITAINCORPOR
GOV_ERRO_TB_RECEITASERVICOS
GOV_ERRO_TGUIASPAGAS
GOV_ERRO_TINTEGRAPAGTO
GOV_ERRO_TMPCADFOR
GOV_ERRO_TMPCENTROS
GOV_ERRO_TMPIMPOSTOS

=== SOAP
<?xml version="1.0" encoding="utf-8"?><soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope"><soap12:Header><nfeCabecMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeConsulta2"><cUF>35</cUF><versaoDados>3.10</versaoDados></nfeCabecMsg></soap12:Header><soap12:Body><nfeDadosMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeConsulta2"><consSitNFe versao="3.10" xmlns="http://www.portalfiscal.inf.br/nfe"><tpAmb>1</tpAmb><xServ>CONSULTAR</xServ><chNFe>35150800767378000115550010008336911107071318</chNFe></consSitNFe></nfeDadosMsg></soap12:Body></soap12:Envelope>

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Header>
    <nfeCabecMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeConsulta2">
      <cUF>35</cUF>
      <versaoDados>3.10</versaoDados>
    </nfeCabecMsg>
  </soap12:Header>
  <soap12:Body>
    <nfeConsultaNF2Result xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeConsulta2">xml</nfeConsultaNF2Result>
  </soap12:Body>
</soap12:Envelope>


<SOAP_REQUEST><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Header><nfeCabecMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeConsulta2"><cUF>35</cUF><versaoDados>3.10</versaoDados></nfeCabecMsg></soap:Header><soap:Body><nfeDadosMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeConsulta2"><consSitNFe versao="3.10" xmlns="http://www.portalfiscal.inf.br/nfe"><tpAmb>1</tpAmb><xServ>CONSULTAR</xServ><chNFe>35150800767378000115550010008336911107071318</chNFe></consSitNFe></nfeDadosMsg></soap:Body></soap:Envelope></SOAP_REQUEST>




1) Certo
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    	<soap:Body>
        		<ns1:ZADDFREDOC0002_RFC xmlns:ns1="urn:sap-com:document:sap:rfc:functions">
            			<ns1:RETORNO_XML></ns1:RETORNO_XML>
            			<ns1:ACCEPT_ENCODING>gzip,deflate</ns1:ACCEPT_ENCODING>
            			<ns1:CODIGO_UF>35</ns1:CODIGO_UF>
            			<ns1:CONTENT_TYPE>application/soap+xml;charset=UTF-8;action="http://www.portalfiscal.inf.br/nfe/wsdl/NfeConsulta2/nfeConsultaNF2"</ns1:CONTENT_TYPE>
            			<ns1:HOST>nfe.fazenda.sp.gov.br</ns1:HOST>
            			<ns1:KEY_STORE>/home/oracle/osb/certificado/alphaville/alphaville.ks</ns1:KEY_STORE>
            			<ns1:KEY_STORE_PASSWORD>ti_alphaville</ns1:KEY_STORE_PASSWORD>
            			<ns1:METHOD>POST</ns1:METHOD>
            			<ns1:MODELO>55</ns1:MODELO>
            			<ns1:SOAP_ACTION>http://www.portalfiscal.inf.br/nfe/wsdl/NfeConsulta2</ns1:SOAP_ACTION>
            			<ns1:SOAP_REQUEST><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Header><nfeCabecMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeConsulta2"><cUF>35</cUF><versaoDados>3.10</versaoDados></nfeCabecMsg></soap:Header><soap:Body><nfeDadosMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeConsulta2"><consSitNFe versao="3.10" xmlns="http://www.portalfiscal.inf.br/nfe"><tpAmb>2</tpAmb><xServ>CONSULTAR</xServ><chNFe>35150800767378000115550010008336911107071318</chNFe></consSitNFe></nfeDadosMsg></soap:Body></soap:Envelope></ns1:SOAP_REQUEST>
            			<ns1:TRUST_STORE>/home/oracle/osb/certificado/alphaville/NFeCacerts</ns1:TRUST_STORE>
            			<ns1:TRUST_STORE_PASSWORD>changeit</ns1:TRUST_STORE_PASSWORD>
            			<ns1:URL>https://nfe.fazenda.sp.gov.br/ws/nfeconsulta2.asmx</ns1:URL>
            			<ns1:USER_AGENT></ns1:USER_AGENT>
        </ns1:ZADDFREDOC0002_RFC>
    </soap:Body>
</soap:Envelope>


RESPONSE:
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing">
   <env:Header>
      <wsa:MessageID>urn:C0C02630EF9211E58F41F9EF921D310B</wsa:MessageID>
      <wsa:ReplyTo>
         <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
         <wsa:ReferenceParameters>
            <instra:tracking.ecid xmlns:instra="http://xmlns.oracle.com/sca/tracking/1.0">cf01ee76593e9adb:6bf0aa7d:15396c2b301:-8000-000000000000083c</instra:tracking.ecid>
         </wsa:ReferenceParameters>
      </wsa:ReplyTo>
      <wsa:FaultTo>
         <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
         <wsa:ReferenceParameters>
            <instra:tracking.ecid xmlns:instra="http://xmlns.oracle.com/sca/tracking/1.0">cf01ee76593e9adb:6bf0aa7d:15396c2b301:-8000-000000000000083c</instra:tracking.ecid>
         </wsa:ReferenceParameters>
      </wsa:FaultTo>
   </env:Header>
   <env:Body>
      <ZADDFREDOC0002_RFC.Response xmlns="urn:sap-com:document:sap:rfc:functions.response">
         <RETORNO_XML><![CDATA[<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
   <soap:Body>
      <soap:Fault>
         <soap:Code>
            <soap:Value>soap:Receiver</soap:Value>
         </soap:Code>
         <soap:Reason>
            <soap:Text xml:lang="en">Server was unable to process request. ---> Root element is missing.</soap:Text>
         </soap:Reason>
         <soap:Detail/>
      </soap:Fault>
   </soap:Body>
</soap:Envelope>]]></RETORNO_XML>
      </ZADDFREDOC0002_RFC.Response>
   </env:Body>
</env:Envelope>



1) Errado
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    	<soap:Body>
        		<ns1:ZADDFREDOC0002_RFC xmlns:ns1="urn:sap-com:document:sap:rfc:functions">
            			<ns1:RETORNO_XML></ns1:RETORNO_XML>
            			<ns1:ACCEPT_ENCODING>gzip,deflate</ns1:ACCEPT_ENCODING>
            			<ns1:CODIGO_UF>35</ns1:CODIGO_UF>
            			<ns1:CONTENT_TYPE>application/soap+xml;charset=UTF-8;action="http://www.portalfiscal.inf.br/nfe/wsdl/NfeConsulta2/nfeConsultaNF2"</ns1:CONTENT_TYPE>
            			<ns1:HOST>nfe.fazenda.sp.gov.br</ns1:HOST>
            			<ns1:KEY_STORE>/home/oracle/osb/certificado/alphaville.ks</ns1:KEY_STORE>
            			<ns1:KEY_STORE_PASSWORD>ti_alphaville</ns1:KEY_STORE_PASSWORD>
            			<ns1:METHOD>POST</ns1:METHOD>
            			<ns1:MODELO>55</ns1:MODELO>
            			<ns1:SOAP_ACTION>http://www.portalfiscal.inf.br/nfe/wsdl/NfeConsulta2</ns1:SOAP_ACTION>
            			<ns1:SOAP_REQUEST><SOAP_REQUEST><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Header><nfeCabecMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeConsulta2"><cUF>35</cUF><versaoDados>3.10</versaoDados></nfeCabecMsg></soap:Header><soap:Body><nfeDadosMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeConsulta2"><consSitNFe versao="3.10" xmlns="http://www.portalfiscal.inf.br/nfe"><tpAmb>1</tpAmb><xServ>CONSULTAR</xServ><chNFe>35150800767378000115550010008336911107071318</chNFe></consSitNFe></nfeDadosMsg></soap:Body></soap:Envelope></SOAP_REQUEST></ns1:SOAP_REQUEST>
            			<ns1:TRUST_STORE>/home/oracle/osb/certificado/alphaville.ks</ns1:TRUST_STORE>
            			<ns1:TRUST_STORE_PASSWORD>ti_alphaville</ns1:TRUST_STORE_PASSWORD>
            			<ns1:URL>https://nfe.fazenda.sp.gov.br/ws/nfeconsulta2.asmx</ns1:URL>
            			<ns1:USER_AGENT></ns1:USER_AGENT>
        </ns1:ZADDFREDOC0002_RFC>
    </soap:Body>
</soap:Envelope>

